{
    "ads": {
        "settings": {
            "interval_interstitial": 5,
            "interstitial_type": "lap",
            "switch_ads_type": "only_banner",
            "make_app_crash_when_app_not_live_at_play_store": false,
            "make_app_under_maintenance": false,
            "rate_dialog_count": 99999
        },
        "ad_network": [
            {
                "name": "off",
                "value": 1,
                "min_time": 120,
                "appId_appKey_publisherId_gameId": "-",
                "banner": "-",
                "mrec": "off",
                "inter": "-",
                "native_ad": "-",
                "open_ad": "off",
                "splash_ad": false
            }
        ]
    },
    "app_settings": {
        "navigation_mode": "navigation_drawer",
        "recent_fragment_list_view_mode": "small",
        "favorite_fragment_list_view_mode": "small",
        "category_fragment_list_view_mode": "big",
        "category_activity_list_view_mode": "big",
        "hide_short_desc_category_activity_list": false,
        "item_interval_native_ad_list": 4,
        "enable_banner_ads": true,
        "enable_category": false,
        "enable_more_app": false
    },
    "More": [
        {
            "id": 1,
            "title": "IQ Test vs The Moron Test",
            "image": "https://play-lh.googleusercontent.com/-hbyzqqYI7QzD_m0QwQrawyqaydnWMgR0Lht24oSSBYjj_YkVmImcId_KFunuWQuWAE=s180-rw",
            "link": "https://play.google.com/store/apps/details?id=com.aliendroid.squidiqgame"
        },
        {
            "id": 2,
            "title": "Skins Editor for Minecraft PE",
            "image": "https://play-lh.googleusercontent.com/cYR5MGCN1wmwJ4iPFnLY8VRrysIctw90JUxkTQkkB-utrSFLd2j5vNX7NsUs4xL5Gw=s180-rw",
            "link": "https://play.google.com/store/apps/details?id=com.aliendroid.skinforminecraft"
        }
    ],
    "Categories": [
        {
            "id": 1,
            "name_category": "Playstore",
            "image": "file:///android_asset/image/image1.png"
        },
        {
            "id": 2,
            "name_category": "Tutorial",
            "image": "file:///android_asset/image/image2.webp"
        },
        {
            "id": 3,
            "name_category": "Reskin",
            "image": "https://s3.ap-southeast-1.amazonaws.com/aliendroid/uploads/blog/202110/img_thumb_616ec085f3a296-86862239-28733081.jpg"
        }
    ],
    "Data": [
        {
            "id": 1,
            "name_category": "KyberSwapClassic",
            "title": "Overview",
            "image": "file:///android_asset/image/icon.png",
            "description": "KyberSwap Classic Revolutionizing DeFi with Enhanced Capital Efficiency and Risk-Adjusted Returns",
            "link": "cat->UserGuide"
        },
        {
            "id": 2,
            "name_category": "UserGuide",
            "title": "Overview KyberSwap Classic",
            "image": "file:///android_asset/image/icon.png",
            "description": "Revolutionizing DeFi with Enhanced Capital Efficiency and Risk-Adjusted Returns",
            "link": "<p><strong>KyberSwap Classic:</strong> Revolutionizing DeFi with Enhanced Capital Efficiency and Risk-Adjusted Returns</p><p><strong>Introduction:</strong></p><p>DeFi (Decentralized Finance) has witnessed tremendous growth, but with it comes the need for continuous innovation to address the limitations of existing models. <strong>KyberSwap Classic</strong> emerged as a solution to the shortcomings observed in the standard Automated Market Maker (AMM) model. This revolutionary platform focuses on optimizing capital efficiency, addressing price spreads, and adapting to market conditions to enhance overall performance.</p><p><strong>The Inadequacies of Standard AMM Models:</strong></p><p>The conventional AMM model operates on a one-size-fits-all pricing curve, deploying capital across all prices without considering the price correlation between unique token pairs. This approach often results in suboptimal capital utilization, limiting the potential returns for liquidity providers (LPs). Additionally, market-neutral price spreads, irrespective of market volatility, diminish LP incentives. During periods of heightened volatility, LPs face increased risks of impermanent loss, yet they are unable to charge a premium for market making.</p><p><strong>KyberSwap Classic's Innovative Approach:</strong></p><p><strong>KyberSwap Classic</strong> addresses these challenges through a unique approach to capital utilization and fee adjustments. By amplifying capital utilization, the platform ensures that funds are strategically deployed based on the correlation between token pairs. This targeted approach maximizes the efficiency of capital, enabling LPs to achieve better returns.</p><p>Furthermore, <strong>KyberSwap Classic</strong> dynamically adjusts trading fees to capitalize on existing market conditions. Unlike traditional AMMs with fixed fees, <strong>KyberSwap Classic's</strong> self-adjusting fee mechanism allows LPs to charge premiums during periods of high volatility. This innovation not only enhances LP incentives but also mitigates the impact of impermanent loss, providing a more sustainable and lucrative environment for liquidity provision.</p><p><strong>Benefits for Liquidity Providers and Traders:</strong></p><p><strong>KyberSwap Classic's</strong> commitment to maximizing yields and encouraging deeper market liquidity yields several benefits for both liquidity providers and traders. Providers experience improved risk-adjusted returns, as the platform's dynamic fee structure aligns with market conditions. Simultaneously, traders benefit from reduced slippage, enhancing the overall trading experience.</p><p><strong>Conclusion:</strong></p><p>In the rapidly evolving landscape of DeFi, <strong>KyberSwap Classic</strong> stands out as a trailblazer, addressing the limitations of standard AMM models. Through its emphasis on optimizing capital efficiency, adapting to market conditions, and providing a more favorable environment for liquidity providers and traders alike, <strong>KyberSwap Classic</strong> contributes to the continued evolution and maturation of the decentralized finance ecosystem. As the platform continues to innovate, it holds the potential to redefine the dynamics of decentralized exchanges, setting new standards for efficiency and profitability in the DeFi space.</p>"
        },
        {
            "id": 3,
            "name_category": "UserGuide",
            "title": "Creating a Classic Pool",
            "image": "file:///android_asset/image/icon.png",
            "description": "Establishing an Amplified Pool with Custom Fee Settings",
            "link": "<p><strong>Creating a Classic Pool:</strong> Establishing an Amplified Pool with Custom Fee Settings</p><p><strong>Introduction:</strong></p><p>To engage in a <strong>KyberSwap Classic</strong> pool and earn fees, the initial step is to add liquidity to the pool. This can be done in an existing pool or by creating a new one. This guide outlines the process of creating a new pool through liquidity addition.</p><p><strong>Liquidity Provider Flow:</strong> Adding liquidity to establish a new pool</p><p><strong>Step 1:</strong> Pool Creation</p><p>Ensure you are on the correct network and click the “Create Pool” button at the top right of the screen.</p><p><strong>Step 2:</strong> Token Selection</p><p>Select the token pair for the pool, choosing from pre-approved tokens or those on your network.</p><p><strong>Non-standard Tokens:</strong> <strong>KyberSwap</strong> allows users to provide liquidity for any token implementing the interface. While this allows interoperability, token teams can specify custom mechanics, such as supply/demand, leading to potential surprises.</p><p><strong>Step 3:</strong> Token Amount Entry</p><p>Specify the amounts of tokens to contribute as liquidity. The price ratio of the tokens is displayed at the bottom left of the screen.</p><p><strong>Price Deviations:</strong> <strong>KyberSwap Classic</strong> prompts LPs if the specified pool price significantly deviates from the market price.</p><p><strong>Step 4:</strong> AMP Value Selection</p><p>After selecting a price ratio, enter an AMP value (amplification factor) for enhanced capital efficiency. The active price range changes accordingly.</p><p><strong>Step 5:</strong> Fee Tier Selection</p><p>Select your fee tier based on token pair correlations.</p><p><strong>Step 6:</strong> Contract Authorization</p><p>If not done already, authorize the <strong>KyberSwap</strong> smart contract for token transactions on the network.</p><p><strong>Step 7:</strong> Pool Creation Review</p><p>Click Create to preview the screen. Confirm the transaction in your wallet. Once confirmed, view the transaction on the blockchain explorer.</p><p>Your new position is now visible on the My Pools page on <strong>KyberSwap</strong>.</p>"
        },
        {
            "id": 4,
            "name_category": "UserGuide",
            "title": "Adding Liquidity To An Existing Classic Pool",
            "image": "file:///android_asset/image/icon.png",
            "description": "Adding Liquidity To An Existing Classic Pool: Capital Efficient Pools And Dynamic Fees",
            "link": "<p><strong>Adding Liquidity To An Existing Classic Pool:</strong> Capital Efficient Pools And Dynamic Fees</p><p><strong>Introduction:</strong></p><p>To engage in a <strong>KyberSwap Classic</strong> pool and earn fees, the initial step is to add liquidity to the pool. This can be done in an existing pool or by creating a new one. This guide outlines the process of adding liquidity to an existing pool.</p><p><strong>Liquidity Provider Flow:</strong> Adding liquidity to an existing pool</p><p><strong>Step 1:</strong> View available pools</p><p>Ensure you are on the correct network, and then choose the tokens to provide as liquidity. You can do this through the token selectors at the top of the Classic Pools interface. Once you’ve selected your pair of tokens, a filtered list of pools that use that pair will be displayed on the interface.</p><p><strong>Step 2:</strong> Select pool</p><p>Select the pool you’d like to participate in by clicking on the appropriate “Add Liquidity” button (in card view) or the “+” button (in list view). This will open the Add Liquidity screen.</p><p><strong>For the safety of our LPs, KyberSwap Classic</strong> will highlight pools which are out of range with the caution icon on the pool card.</p><p><strong>Non-standard tokens:</strong> As a permissionless protocol, <strong>KyberSwap</strong> enables users to provide liquidity and market make for any token implementing the interface. While this standard interface allows interoperability, token teams can specify customized token mechanics, but KyberSwap Classic does not support non-standard tokens for safety reasons.</p><p><strong>Step 3:</strong> Configure token amounts for liquidity provision</p><p>To deposit double-sided liquidity, make sure “Token Pair” is selected on the toggle at the top of the screen, then specify the amounts you would like to deposit. You can either manually type in amounts or use the “Max” and “Half” buttons. Once you specify the deposit amount for one leg of the pair, the corresponding leg’s amount will be automatically calculated and populated for you.</p><p><strong>Step 4:</strong> Authorize contract</p><p>If you haven’t already done so, you will need to authorize the <strong>KyberSwap</strong> smart contract to transact using your tokens on this network. Click the “Approve [Token]” button to do so.</p><p><strong>Step 5:</strong> Review liquidity provision</p><p>Click on the “Supply” button to bring up the preview screen. As an AMM protocol, any addition of liquidity to the pool might result in slippage. To minimize slippage effects, KyberSwap Classic enables you to configure a slippage tolerance.</p><p>Once you have reviewed the information on this screen, click on the “Supply” button to proceed.</p><p>You will need to confirm this transaction in your wallet. Once confirmed, you will see a screen informing you that the transaction has been submitted. You can click on “View Transaction” to view your transaction on the appropriate blockchain explorer.</p><p>Your new position should now be visible on the My Pools page on <strong>KyberSwap</strong>, displaying all your active KyberSwap Classic pools.</p>"
        },
        {
            "id": 5,
            "name_category": "UserGuide",
            "title": "Yield Farming On Classic",
            "image": "file:///android_asset/image/icon.png",
            "description": "Yield Farming On Classic: Claim Additional Classic Rewards",
            "link": "<p><strong>Yield Farming On Classic:</strong> Claim Additional Classic Rewards</p><br><p><strong>Introduction:</strong> Yield Farming or Liquidity Mining in DeFi allows LPs to earn a return on contributed capital. This guide covers yield farming on KyberSwap Classic.</p><br><p><strong>Liquidity Provider Flow:</strong> Staking LP tokens</p><br><p><strong>Step 1:</strong> Create a Classic liquidity position;<br><strong>Step 2:</strong> Select farming pool;<br><strong>Step 3:</strong> Approve farming contract;<br><strong>Step 4:</strong> Specify stake amount;<br><strong>Step 5:</strong> Confirm farming transaction.</p><br><p><strong>Harvesting and Claiming Rewards:</strong></p><br><p><strong>Step 1:</strong> Select pools to harvest;<br><strong>Step 2:</strong> Confirm harvest;<br><strong>Step 3:</strong> Claim vested rewards (if applicable).</p><br><p><strong>Unstaking LP Tokens:</strong></p><br><p><strong>Step 1:</strong> Select pool to unstake;<br><strong>Step 2:</strong> Select unstake amount;<br><strong>Step 3:</strong> Confirm unstake (auto-harvests unclaimed rewards).</p>"
        },
        {
            "id": 6,
            "name_category": "UserGuide",
            "title": "Removing Liquidity On Classic",
            "image": "file:///android_asset/image/icon.png",
            "description": "Removing Liquidity On Classic: Unlocking a New Opportunity",
            "link": "<p><strong>Removing Liquidity On Classic:</strong> Unlocking a New Opportunity</p><p><strong>Introduction:</strong> Whether you've found a more promising yield opportunity or simply wish to take a break from the markets, reducing liquidity within a position or exiting it entirely is straightforward. This guide outlines the steps to remove all or part of your liquidity from a position on KyberSwap Classic.</p><p><strong>Liquidity Provider Flow:</strong> Removing liquidity position</p><p><strong>Step 1:</strong> Select position Navigate to the My Pools page, choose the position from which you want to remove liquidity, and click on its Remove Liquidity button.</p><p><strong>Classic pools dashboard</strong> This action brings up the Remove Liquidity screen.</p><p><strong>Step 2:</strong> Specify removal amount KyberSwap Classic offers LPs the option to withdraw their position as a token pair or a single token. Withdrawing to a single token (a.k.a zaps) enables users to conveniently withdraw their position's value as either token in the pool. LPs can choose to remove part or the whole position.</p><p><strong>Token pair removal</strong> Specify the amount of liquidity to remove. You can do this either by using the pre-set percentage buttons or the percentage slider, or by manually typing in the amount for either leg of the pair.</p><p><strong>Non-standard tokens</strong> As a permissionless protocol, KyberSwap enables users to provide liquidity and market make for any token implementing the interface. While this standard interface enables interoperability between various DeFi protocols (including KyberSwap), token teams can still specify customized token mechanics, resulting in unexpected outcomes.</p><p><strong>Note that the token mechanics are specified as part of the token's smart contract, and KyberSwap does not have control over specific token implementations. Some examples of non-standard tokens include Fee-on-transfer (FOT), Rebase, and LP tokens representing a proportional claim of a liquidity pool's assets.</strong> To ensure the safety of our users' funds, KyberSwap Classic does not support non-standard tokens. Please conduct your own research before providing liquidity using such tokens, as KyberSwap was optimized to handle the standard ERC20 implementation.</p><p><strong>Step 3:</strong> Authorize contract If you haven't done so, permit the pool contract to remove your position from the pool. Note that this signature request does not require any gas.</p><p><strong>Metamask permit signature</strong> Once you have authorized the contract, the previously disabled Remove button will now be available.</p><p><strong>Step 4:</strong> Review liquidity removal Click the Remove button to bring up the preview screen, displaying key information for review.</p><p><strong>Removal confirmation pop-up - Amount of tokens you will receive after removing the position - Current price: the rate at which the swap will happen (this can be inverted using the 🔁 button). - LP Tokens Removed: The number of LP tokens, representing your position, that will be removed - Minimum Received: This is the minimum amount of output tokens that you will receive from the removal. The removal will only be completed if this minimum amount threshold is achieved; else, the transaction will revert.</strong> Slippage: Protecting your liquidity As an AMM protocol, any removal of liquidity from the pool might result in slippage, whereby the final amount withdrawn differs from the expected amount. To minimize the effects of slippage, KyberSwap Classic enables you to configure a slippage tolerance that caps the amount of slippage above which your transaction will be reverted (i.e., failed and canceled).</p><p><strong>Please refer to the documentation for further details on why slippage occurs and how to protect your liquidity additions or removals.</strong> Click the Confirm button to proceed. You should be prompted to confirm the transaction in your wallet.</p><p><strong>KyberSwap pending confirmation Metamask confirmation Once confirmed, the Transaction Submitted screen will appear. You can click on View Transaction to see your transaction on the blockchain explorer.</strong></p>"
        },
        {
            "id": 7,
            "name_category": "KyberSwap Elastic",
            "title": "KyberSwap Elastic",
            "image": "file:///android_asset/image/icon.png",
            "description": "Customized Liquidity Positions With Auto-Compounding Yields",
            "link": "cat->UserHints"
        },
        {
            "id": 8,
            "name_category": "UserHints",
            "title": "KyberSwap Elastic",
            "image": "file:///android_asset/image/icon.png",
            "description": "Tailored Liquidity Positions with Auto-Compounding Yields",
            "link": "<p><strong>KyberSwap Elastic:</strong> Tailored Liquidity Positions with Auto-Compounding Yields</p><p>In the evolving AMM landscape, the demand for sophisticated yield generation strategies prompted the creation of KyberSwap Elastic. This platform responds to the need for customized liquidity positions, allowing providers to specify price ranges. Building upon the capital amplification features of KyberSwap Classic and integrating concentrated liquidity concepts from Uniswap V3, KyberSwap Elastic empowers liquidity providers to determine preferred price ranges while maximizing returns through enhanced capital efficiency and auto-compounding of yields.</p><p>With improved LP incentives, KyberSwap Elastic reduces slippage for traders by incentivizing liquidity concentration within actively traded price ranges. Liquidity providers can compound risk-adjusted returns, fostering market stability through decreased slippage risks for traders.</p><p>⚡ Elastic Zap ⚡</p><p>Liquidity providers can now easily zap into Elastic pools, simplifying the liquidity addition process with a single token and minimizing complexities associated with exact token ratios. Explore the Elastic Zap explainer to learn how KyberSwap enhances the LP experience, reducing position management costs and risks.</p><p>Supported on:<br>- Arbitrum (ChainID: 42161)<br>- Polygon PoS (ChainID: 137)<br>- Optimism (ChainID: 10)<br>- Avalanche (ChainID: 43114)<br>- Base (ChainID: 8453)<br>- Scroll (ChainID: 534352)</p><p><strong>Elastic Legacy</strong></p><p>On April 17, 2023, KyberSwap addressed a vulnerability reported by a whitehat hacker, leading to a temporary pause in Elastic pools and farms. User funds were safely withdrawn from affected contracts. For users with remaining funds in Elastic Legacy, refer to the Remove Elastic Legacy Liquidity guide for fund retrieval.</p><p>As of May 25, 2023, all relevant Elastic protocol and farm contracts have been updated to resolve the issue. Check Elastic Legacy for additional details.</p>"
        },
        {
            "id": 9,
            "name_category": "UserHints",
            "title": "Guides for Users KyberSwap Elastic",
            "image": "file:///android_asset/image/icon.png",
            "description": "Guides for Users: Easy-to-Follow Tutorials",
            "link": "<p><strong>Guides for Users:</strong> Easy-to-Follow Tutorials</p><p>The provided user guides are designed for KyberSwap Elastic liquidity providers, offering comprehensive tutorials covering the entire process—from liquidity provision and yield farming to liquidity position exits. This section has been curated to address the varying liquidity provision steps between Classic and Elastic protocols.</p><p>If you're uncertain about the protocol that best suits your needs, explore the Classic vs. Elastic page. Alternatively, kickstart your yield generation journey by visiting Earn Yield By Contributing Liquidity.</p><p>For all other use cases, such as swaps, wallet management, and more, please consult the User Guides section within the KyberSwap Interface.</p>"
        },
        {
            "id": 10,
            "name_category": "UserHints",
            "title": "Creating an Elastic Pool",
            "image": "file:///android_asset/image/icon.png",
            "description": "Establish a Concentrated Liquidity Pool with Custom Fees",
            "link": "<p><strong>Creating an Elastic Pool:</strong> Establish a Concentrated Liquidity Pool with Custom Fees</p><p><strong>Introduction:</strong> To earn fees in a KyberSwap Elastic pool, you must first add liquidity, creating a new position. Follow these steps to initiate a new pool and add liquidity.</p><p><strong>Note:</strong> Adding Liquidity differs from Increasing Liquidity, which involves enlarging an existing position. Refer to Add Liquidity To An Existing Elastic Pool for increasing your position.</p><p><strong>Adding liquidity to create a new pool:</strong></p><p><strong>Step 1:</strong> Ensure you're on the correct network and click Create Pool at the top right.</p><p><strong>Step 2:</strong> Select tokens for the pool creation.</p><p><strong>Step 3:</strong> Choose the fee tier and view the liquidity distribution.</p><p><strong>Step 4:</strong> Set the starting price for the pool.</p><p><strong>Step 5:</strong> Set the price range within which your capital will be used.</p><p><strong>Step 6:</strong> Specify the liquidity amount you want to add.</p><p><strong>Step 7:</strong> Authorize the contract to transact with your tokens.</p><p><strong>Step 8:</strong> Review the liquidity provision transaction and confirm it in your wallet.</p><p>Your new position will be visible on the My Pools page on KyberSwap once the transaction is confirmed.</p>"
        },
        {
            "id": 11,
            "name_category": "UserHints",
            "title": "Adding Liquidity To An Existing Elastic Pool",
            "image": "file:///android_asset/image/icon.png",
            "description": "Capital Efficient Pools With Auto-Compounding Yields",
            "link": "<p><strong>Adding Liquidity To An Existing Elastic Pool:</strong> Capital Efficient Pools With Auto-Compounding Yields</p><p><strong>Introduction:</strong> To participate in a KyberSwap Elastic pool and earn fees, add liquidity, opening a new position. This guide covers the steps for adding liquidity to an existing pool.</p><p><strong>Note:</strong> Adding Liquidity is different from Increasing Liquidity, which increases the size of an existing position. Refer to Increasing Liquidity On Elastic for adding more liquidity to an existing position.</p><p><strong>Liquidity Provider Flow:</strong> Adding liquidity to an existing pool.</p><p><strong>Step 1:</strong> View available pools. Choose tokens and view the filtered list of pools on the Elastic Pools interface.</p><p><strong>Step 2:</strong> Select pool. Click Add Liquidity or Zap In to open the Add Liquidity screen.</p><p><strong>Step 3:</strong> Select fee tier. Choose a fee tier with liquidity distribution and apply Quick Zap if needed.</p><p><strong>Step 4:</strong> Set your price range. Choose the range for capital usage; sliders or manual input options are available.</p><p><strong>Step 5:</strong> Configure token amounts. Specify deposit amounts for each leg; use sliders or manual input.</p><p><strong>Step 6:</strong> Authorize contract. Approve the KyberSwap smart contract to transact with your tokens on the network.</p><p><strong>Step 7:</strong> Review liquidity provision. Click Preview to review, set slippage tolerance, and click Supply to proceed.</p><p>Your new position will be visible on the My Pools page on KyberSwap once the transaction is confirmed.</p>"
        },
        {
            "id": 12,
            "name_category": "UserHints",
            "title": "Increasing Liquidity On Elastic",
            "image": "file:///android_asset/image/icon.png",
            "description": "Add To Your Favourite Concentrated Liquidity Positions",
            "link": "<p><strong>Increasing Liquidity On Elastic:</strong> Add To Your Favourite Concentrated Liquidity Positions</p><p><strong>Introduction:</strong> If you have a KyberSwap Elastic liquidity pool position and want to increase its size, follow the steps for Increasing Liquidity.</p><p><strong>Note:</strong> Increasing Liquidity is different from Adding Liquidity. Adding Liquidity creates a new position, while Increasing Liquidity enlarges a current position. Refer to Add Liquidity To An Existing Elastic Pool for new positions.</p><p><strong>Liquidity Provider Flow:</strong> Increasing the liquidity of an existing position.</p><p><strong>Step 1:</strong> Select position from My Positions page and click Increase Liquidity or ⚡Zap In button.</p><p><strong>Step 2:</strong> Configure additional liquidity amounts. Specify amounts manually or use Max and Half buttons based on the associated price range.</p><p><strong>Step 3:</strong> Authorize contract. Click Approve [Token] to authorize KyberSwap smart contract for transactions.</p><p><strong>Step 4:</strong> Review increase liquidity. Click Preview to review, set slippage tolerance, and click Supply to proceed.</p><p>The increased position will be visible on the My Positions page once the transaction is confirmed.</p>"
        },
        {
            "id": 13,
            "name_category": "UserHints",
            "title": "Elastic Fee Collection",
            "image": "file:///android_asset/image/icon.png",
            "description": "Reaping Your Auto-Compounded Yields",
            "link": "<p><strong>Elastic Fee Collection:</strong> Reaping Your Auto-Compounded Yields</p><p><strong>Introduction:</strong> When your active position supports trades, market making fees are automatically reinvested into the pool. KyberSwap Elastic allows LPs to independently collect accrued fees without affecting their liquidity position, providing the flexibility to benefit from auto-compounded yields at any time.</p><p><strong>Fee collection for positions staked in farms:</strong> KyberSwap Elastic enables LPs to earn farming rewards while collecting trading fees. If your liquidity position is staked in a farm, you can collect fees without unstaking, avoiding gas fees and ensuring continuous farming rewards.</p><p><strong>Liquidity Provider Flow:</strong> Collecting your auto-compounded fees</p><p><strong>Step 1:</strong> Select position from My Pools page. View total accrued fees on the position card. Click Collect Fees (enabled in green if fees are accrued).</p><p><strong>Step 2:</strong> Collect the fees. Confirm the action in Metamask; this will remove 100% of the accrued fees.</p><p><strong>Fee-on-transfer tokens:</strong> KyberSwap Elastic does not support Fee-on-transfer (FOT) tokens. Transactions involving FOT tokens will fail for user safety. FOT tax is specified in the token's smart contract; KyberSwap has no control over the FOT mechanism. Users trade FOT tokens at their own risk.</p><p><strong>Step 3:</strong> Fees collected. KyberSwap notifies you of the successful fee collection upon transaction confirmation. Fees are also removed from your position.</p>"
        },
        {
            "id": 14,
            "name_category": "UserHints",
            "title": "Yield Farming On Dynamic Farms",
            "image": "file:///android_asset/image/icon.png",
            "description": "Claim Additional Elastic Rewards",
            "link": "<p><strong>Yield Farming On Dynamic Farms:</strong> Claim Additional Elastic Rewards</p><p><strong>Dynamic Farms: Market driven rewards:</strong> Following feedback on Dynamic Farms, KyberSwap has introduced an alternative Elastic Farming mechanism in Static Farms to enable for more customizable reward distribution parameters. Unlike Dynamic Farms which require the underlying liquidity position to support the active market price, Static Farms enable LPs to continue earning farming rewards by contributing liquidity towards an operator defined farm range. Please refer to Tick-Based Farming for a detailed comparison between the two mechanisms. For a guide on Static Farms, please refer to Yield Farming On Static Farms.</p><p><strong>Introduction:</strong> Yield Farming or Liquidity Mining is a aspect of DeFi that allows Liquidity Providers (LPs) to passively earn a return on capital contributed to a liquidity pool. The Yield Farm provides LPs with rewards over time to incentivize LPs to continue to provide liquidity to the pool as well as to help offset their risk. This guide covers yield farming on KyberSwap Elastic Dynamic Farms. It covers the following aspects of yield farming on Dynamic Farms: Staking Liquidity Positions, Harvesting and Claiming Rewards, Unstaking Liquidity Positions</p><p><strong>Liquidity Provider Flow:</strong> Staking liquidity positions</p><p><strong>Step 1:</strong> Select farm and open a position</p><p>You can view and filter the list of active farms on the Farms page. For the purposes of this guide, we will use a KNC - LINK pool with a fee tier of 1% on Polygon PoS. Dynamic Farms reward eligibility: You will continue to earn Dynamic Farming rewards as long as the token continues to trade within the position's selected range. That is, your position's selected range must encompass the active market price to be eligible for farming rewards. You can refer to Dynamic Farms concept guide if you require further information on the exact farming mechanism. Do note that an existing position will be required to be eligible for farming rewards. You can skip this section if you have an existing eligible position. For the complete guide on how to add liquidity to an Elastic pool, please refer to Add Liquidity To An Existing Elastic Pool.</p><p><strong>Open liquidity position</strong></p><p><strong>Step 2:</strong> Approve the farming contract</p><p>If this is your first time interacting with Elastic Dynamic Farms on this particular network, you will need to give approval for the farming smart contract to manage your wallet and balances. Click on the “Approve Farming Contract” button on the Farms page to begin. This will require an onchain approval through your Web3 wallet. Note: Be sure to check that the smart contract address is correct before authorizing the smart contract. KyberSwap Elastic farming smart contract addresses can be found here.</p><p><strong>Step 3:</strong> Stake your position in the farm</p><p><strong>Stake directly into Dynamic Farms:</strong> As an added convenience feature, Liquidity Providers are now able to directly stake their positions into their selected farm without first having to deposit their NFT positions into the Dynamic Farms contract. Positions are automatically deposited and staked into the farm hence LPs will only have to sign a single transaction to reap the farming rewards.</p><p>Click on the “+ Stake” button to stake your NFT position. Select the appropriate NFT from the list on the next screen and click the “Stake Selected” button to proceed. (This is an onchain transaction.) Your position is staked and is now eligible to accumulate rewards for the duration of the farming phase. You should now also be able to see your farming pool under the “My Farms” tab. This page will also display ended phases for the farms that you are currently participating in. Note: Depending on the farming mechanism associated with your farm, your rewards will be calculated depending on the value of your liquidity position staked in the farm relative to other farmers, how long your liquidity position has been active in the pool (i.e. in range), and the trading volume utilizing your active liquidity position in the pool.</p><p><strong>Step 4:</strong> View your staked positions</p><p><strong>Toggle farm view:</strong> KyberSwap Elastic farms provides you two options when viewing your staked positions. This can be toggled using the view option in the filter bar located at the top of the page.</p><p><strong>Farm grid overview:</strong> In the grid view, all active farms will be displayed as individual cards in a grid. Your staked farms will be prioritized at the beginning of the grid. Note that in the grid overview page, you will be able to see how many of your positions are in or out of range by referring to the top right of each card.</p><p><strong>Farm grid details:</strong> To expose further details, you can select on the View Positions button at the bottom of each farm card.</p><p>By viewing the positions in farms where you have a staked position, you will be able to view all the staked positions within the particular farm as well as the active price relative to the range of your staked positions.</p><p><strong>Harvesting and claiming rewards</strong></p><p><strong>Step 1:</strong> Select pools to harvest</p><p><strong>Step 2:</strong> Confirm harvest</p><p>If the pool does not have a rewards vesting schedule, your rewards will automatically be sent to your wallet. But if the pool has a vesting schedule, you will need to wait some time after harvesting for the rewards to vest before you can claim them.</p><p><strong>Step 3:</strong> Claim vested rewards (vested pools only)</p><p><strong>Unstaking liquidity positions</strong></p><p><strong>Step 1:</strong> Select pool to unstake</p><p><strong>Step 2:</strong> Confirm unstake</p><p>As part of this action, any as-yet unharvested rewards will also automatically be harvested. From this point on, your liquidity position can either once again be staked into an active phase of the pool to earn rewards, or it can be withdrawn entirely from the farming contract.</p><p><strong>Step 3:</strong> Withdraw from farming contract</p><p><strong>Conclusion:</strong> KyberSwap Elastic Dynamic Farms provide an additional way for liquidity providers to earn rewards and actively participate in the decentralized finance ecosystem. By staking your liquidity positions in Dynamic Farms, you not only contribute to the liquidity of the ecosystem but also stand to gain rewards over time. The process involves selecting a farm, opening a position, staking your liquidity position, harvesting rewards, and potentially unstaking or withdrawing from the farming contract. The user interface provided by KyberSwap makes it convenient for users to navigate through these steps and actively manage their liquidity positions.</p>"
        },
        {
            "id": 15,
            "name_category": "UserHints",
            "title": "Yield Farming on Static Farms",
            "image": "file:///android_asset/image/icon.png",
            "description": "Yield Farming on Static Farms: Maximizing Rewards with Ease",
            "link": "<strong>Yield Farming on Static Farms: Maximizing Rewards with Ease</strong> <br> <br> <strong>Introduction</strong> <br> <br> Yield farming, an integral part of DeFi, empowers Liquidity Providers (LPs) to passively earn returns on contributed capital. KyberSwap's Elastic Static Farms offer a lucrative alternative for LPs, introducing a novel approach to reward distribution. Unlike Dynamic Farms, where market conditions dictate rewards, Static Farms allow LPs to earn rewards independently by contributing liquidity within an operator-defined farm range. <br> <br> <strong>Static Farm Innovations</strong> <br> <br> Elastic Static Farms usher in innovations, with rewards distributed based on a staker's liquidity contribution within a predefined farming range. This autonomy over reward distribution enhances the experience for both farming operators and stakers. The introduction of farming ranges and range weights ensures precise reward allocation, detailed in the Static Farms APR calculation. <br> <br> Key features include: - Farms with multiple overlapping ranges, each configured by the operator. - Weights determining the proportion of total rewards for each range. - Staking a liquidity position in a single farming range for optimal rewards. <br> <br> <strong>Staking Liquidity Positions</strong> <br> <br> To earn rewards, staking liquidity positions is the first step. Ensure eligibility by following these steps: <br> <br> <strong>Step 1: Select Farm and Open a Position</strong> - Choose a farm, such as the MATIC - USDC pool, on the Farms page. <br> <br> <strong>Step 2: Approve the Farming Contract</strong> - Give approval for the farming smart contract via the Approve Farming Contract button. <br> <br> <strong>Step 3: Stake Your Position in the Farm</strong> - Click the + Stake button for farms with eligible positions. - Select the farming range and staking positions based on provided tabs. - View and track your staked position and rewards on the Farms page. <br> <br> <strong>Harvesting and Claiming Rewards</strong> <br> <br> Once rewards accumulate, follow these steps to harvest and claim: <br> <br> <strong>Step 1: Select Pools to Harvest</strong> - Click the small “pickaxe” button on the Farms page for your desired pool. <br> <br> <strong>Step 2: Confirm Harvest</strong> - Click Harvest on the screen that appears. <br> <br> <strong>Unstaking Liquidity Positions</strong> <br> <br> Unlike Dynamic Farms, where market price influences rewards, Static Farm positions continuously earn rewards. Unstake at any time: <br> <br> <strong>Step 1: Select Pool to Unstake</strong> - Click - Unstake on the Farms page for the desired pool. <br> <br> <strong>Step 2: Confirm Unstake</strong> - Select positions in the unstake preview and click Unstake Selected. <br> <br> <strong>Conclusion</strong> <br> <br> KyberSwap's Elastic Static Farms redefine yield farming, offering LPs a seamless and rewarding experience. By contributing liquidity within predefined ranges, LPs enjoy autonomy over rewards. The guide covers staking, harvesting, and unstaking, providing a comprehensive overview for active participation in decentralized finance."
        },
        {
            "id": 16,
            "name_category": "UserHints",
            "title": "Removing Liquidity on KyberSwap Elastic",
            "image": "file:///android_asset/image/icon.png",
            "description": "Removing Liquidity on KyberSwap Elastic: Seizing New Opportunities",
            "link": "<strong>Removing Liquidity on KyberSwap Elastic: Seizing New Opportunities</strong> <br> <br> <strong>Introduction</strong> <br> <br> Are you eyeing a better yield opportunity or considering a break from the markets? KyberSwap Elastic allows you to effortlessly adjust your liquidity positions by reducing or exiting them completely. This guide outlines the steps to remove all or part of your liquidity from a position. <br> <br> <strong>Removing Liquidity for Farm-Staked Positions</strong> <br> <br> KyberSwap Elastic offers LPs the flexibility to remove liquidity seamlessly, even from positions staked in a farm. Staked positions are automatically withdrawn from the farms, with rewards being harvested simultaneously. This streamlined process, executed in a single transaction, empowers users to readjust positions while maximizing farming rewards. <br> <br> <strong>Liquidity Provider Flow</strong> <br> <br> <strong>Removing Liquidity Positions</strong> <br> <br> <strong>Step 1: Select Position</strong> - On the My Pools page, choose the position you want to adjust and click its “Remove Liquidity” button. <br> <br> <strong>Step 2: Specify Removal Amount</strong> - Specify the removal amount using pre-set percentage buttons, a percentage slider, or manual input for each leg of the pair. If you opt to remove 100% of the liquidity, it closes the position. Closed positions are visible by toggling the “Show closed positions” button on the My Positions page. <br> <br> <strong>Non-Standard Tokens</strong> - KyberSwap supports ERC20-compliant tokens, but non-standard tokens with customized mechanics are not supported for safety reasons. Conduct research before providing liquidity using such tokens. <br> <br> <strong>Step 3: Review Liquidity Removal</strong> - Click “Preview” to review the transaction details, including slippage protection. Adjust the slippage tolerance to cap potential slippage. Click “Remove” and confirm the transaction on your wallet. <br> <br> <strong>Note</strong>: Any uncollected fees and farming rewards will be automatically collected during the liquidity removal transaction, irrespective of the amount removed."
        }
    ],
    "enable_data_2": false,
    "data_2_title": "Judul Data 2",
    "data_2_image_button": "file:///android_asset/image/icon.png",
    "Data2": [
        {
            "id": 1,
            "name_category": "Alvisdeo Mobile",
            "title": "aa",
            "image": "file:///android_asset/image/icon.png",
            "description": "aa",
            "link": "aa"
        }
    ]
}